### Updating Rows and Columns - Modifying Data Within DataFrames

In [32]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [33]:
import pandas as pd

In [34]:
df = pd.DataFrame(people)

In [35]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [36]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [38]:
df.columns = ["first_name", "last_name", "email"]

In [39]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [40]:
df.columns = [x.upper() for x in df.columns]

In [41]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [42]:
df.columns = df.columns.str.replace("_", " ")

In [43]:
df

  FIRST NAME LAST NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [44]:
df.columns = df.columns.str.replace(" ", "_")

In [45]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [46]:
df.columns = [x.lower() for x in df.columns]

In [47]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [48]:
df.rename(columns={"first_name":"first", "last_name":"last"}, inplace=True)

In [49]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [50]:
df.loc[2] = ["John", "Smith", "JohnSmith@email.com"]

In [51]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [52]:
df.loc[2, ["last", "email"]] = ["Doe", "JohnDoe@emailcom"]

In [53]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe         JohnDoe@emailcom

In [55]:
df.loc[2, "last"] = "Smith"
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith         JohnDoe@emailcom

In [57]:
df.at[2, "last"] = "Doe"
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe         JohnDoe@emailcom

In [59]:
filt = (df["email"]=="JohnDoe@emailcom")
filt

0    False
1    False
2     True
Name: email, dtype: bool

In [65]:
df.loc[filt]["last"]=="Smith" #we cannot do this way we need to use .at[] or .loc[]
# df.loc[filt, "last"]=="Smith"

2    False
Name: last, dtype: bool

In [63]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe         JohnDoe@emailcom

In [66]:
df["email"] = df["email"].str.lower()

In [67]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John      Doe         johndoe@emailcom

#### apply()

In [68]:
df["email"].apply(len)

0    23
1    17
2    16
Name: email, dtype: int64

In [73]:
def update_email(email):
    return email.upper()

In [75]:
df["email"].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2           JOHNDOE@EMAILCOM
Name: email, dtype: object

In [76]:
df["email"] = df["email"].apply(update_email)

In [77]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John      Doe         JOHNDOE@EMAILCOM

In [88]:
df["email"].apply(lambda x: x.lower())

0    coreymschafer@gmail.com
1          janedoe@email.com
2           johndoe@emailcom
Name: email, dtype: object

In [80]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [82]:
df.apply(len, axis="columns")

0    3
1    3
2    3
dtype: int64

In [83]:
len(df["email"])

3

In [84]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    COREYMSCHAFER@GMAIL.COM
dtype: object

In [86]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    COREYMSCHAFER@GMAIL.COM
dtype: object

### applymap

In [89]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     3     16

In [93]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john      doe         johndoe@emailcom

### map

In [94]:
df["first"].map({"Corey":"Chris", "Jane":"Mary"})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [95]:
df["first"].replace({"Corey":"Chris", "Jane":"Mary"})

0    Chris
1     Mary
2     John
Name: first, dtype: object